Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: * Lua modules: ** lua-yajl: https://github.com/brimworks/lua-yajl *** Note: the compiled module has to be placed in '/usr/local/lib/lua/5.1/'
zh_cn: * Lua 模块: ** lua-yajl: https://github.com/brimworks/lua-yajl *** Note: the compiled module has to be placed in '/usr/local/lib/lua/5.1/'

source: * Mashup'ing and processing outputs of various nginx upstream outputs (proxy, drizzle, postgres, redis, memcached, and etc) in Lua, * doing arbitrarily complex access control and security checks in Lua before requests actually reach the upstream backends, * manipulating response headers in an arbitrary way (by Lua) * fetching backend information from external storage backends (like redis, memcached, mysql, postgresql) and use that information to choose which upstream backend to access on-the-fly, * coding up arbitrarily complex web applications in a content handler using synchronous but still non-blocking access to the database backends and other storage, * doing very complex URL dispatch in Lua at rewrite phase, * using Lua to implement advanced caching mechanism for Nginx's subrequests and arbitrary locations.
zh_cn: * 在Lua中对各个nginx上游(proxy, drizzle, postgres, redis, memcached等)输出进行混合和处理, * 在请求真正到达上游后端前用Lua进行复杂的访问控制和安全检测, * (使用Lua)对响应头进行任意操作 * 从后端外部存储(象 redis, memcached, mysql, postgresql)获取数据，用这些数据来实时选择访问哪个上游后端, * 在内容处理器中用同步但仍是非阻塞的方式访问后端数据库或其它存储来实现任意复杂的web应用, * 在rewrite阶段用Lua完成非常复杂的URL派发, * 使用Lua为Nginx子请求和任何location实现高级缓存机制.

source: * Nginx modules: ** echo-nginx-module: http://github.com/agentzh/echo-nginx-module ** drizzle-nginx-module: http://github.com/chaoslawful/drizzle-nginx-module ** rds-json-nginx-module: http://github.com/agentzh/rds-json-nginx-module ** set-misc-nginx-module: http://github.com/agentzh/set-misc-nginx-module ** headers-more-nginx-module: http://github.com/agentzh/headers-more-nginx-module ** memc-nginx-module: http://github.com/agentzh/memc-nginx-module ** srcache-nginx-module: http://github.com/agentzh/srcache-nginx-module ** ngx_auth_request: http://mdounin.ru/hg/ngx_http_auth_request_module/
zh_cn: * Nginx 模块: ** echo-nginx-module: http://github.com/agentzh/echo-nginx-module ** drizzle-nginx-module: http://github.com/chaoslawful/drizzle-nginx-module ** rds-json-nginx-module: http://github.com/agentzh/rds-json-nginx-module ** set-misc-nginx-module: http://github.com/agentzh/set-misc-nginx-module ** headers-more-nginx-module: http://github.com/agentzh/headers-more-nginx-module ** memc-nginx-module: http://github.com/agentzh/memc-nginx-module ** srcache-nginx-module: http://github.com/agentzh/srcache-nginx-module ** ngx_auth_request: http://mdounin.ru/hg/ngx_http_auth_request_module/

source: * Nginx version >= 0.8.54
zh_cn: * Nginx 版本>= 0.8.54

source: * Output API functions (e.g., [[#ngx.say|ngx.say]] and [[#ngx.send_headers|ngx.send_headers]]) * Control API functions (e.g., [[#ngx.exit|ngx.exit]] and [[#ngx.exec|ngx.exec]]) * Subrequest API functions (e.g., [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]]) * Cosocket API functions (e.g., [[#ngx.socket.tcp|ngx.socket.tcp]] and [[#ngx.req.socket|ngx.req.socket]]).
zh_cn: * Output API 函数(例如, [[#ngx.say|ngx.say]] and [[#ngx.send_headers|ngx.send_headers]]) * Control API 函数(例如, [[#ngx.exit|ngx.exit]]) * Subrequest API 函数(例如, [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]]) * Cosocket API 函数(例如, [[#ngx.socket.tcp|ngx.socket.tcp]] and [[#ngx.req.socket|ngx.req.socket]]).

source: * Output API functions (e.g., [[#ngx.say|ngx.say]] and [[#ngx.send_headers|ngx.send_headers]]) * Control API functions (e.g., [[#ngx.exit|ngx.exit]]) * Subrequest API functions (e.g., [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]]) * Cosocket API functions (e.g., [[#ngx.socket.tcp|ngx.socket.tcp]] and [[#ngx.req.socket|ngx.req.socket]]).
zh_cn: * Output API 函数(例如, [[#ngx.say|ngx.say]] and [[#ngx.send_headers|ngx.send_headers]]) * Control API 函数(例如, [[#ngx.exit|ngx.exit]]) * Subrequest API 函数(例如, [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]]) * Cosocket API 函数(例如, [[#ngx.socket.tcp|ngx.socket.tcp]] and [[#ngx.req.socket|ngx.req.socket]]).

source: * Perl modules: ** test-nginx: http://github.com/agentzh/test-nginx
zh_cn: * Perl 模块: ** test-nginx: http://github.com/agentzh/test-nginx

source: -- (one may want to buffer the data in Lua a bit to
zh_cn: -- (你可能需要在Lua里对数据进行缓冲以

source: -- access MySQL, PostgreSQL, Redis, Memcached, and etc here...
zh_cn: -- 此处访问 MySQL, PostgreSQL, Redis, Memcached等...

source: -- check if the request body contains bad words
zh_cn: -- 检查request body中是否包含恶意词或敏感词

source: -- check the client IP address is in our black list
zh_cn: -- 检查客户端IP是否在黑名单里

source: -- construct the requests table
zh_cn: -- 构造请求table

source: -- custom cleanup work goes here, like cancelling a pending DB transaction
zh_cn: -- 这里写自定义的清理工作，如取消一个等待中的数据库事务

source: -- do some routine job in Lua just like a cron job
zh_cn: -- 用Lua做一些日常任务，就象cron一样

source: -- equivalent to ngx.header["Content-Type"] = 'text/plain'
zh_cn: -- 等价于 ngx.header["Content-Type"] = 'text/plain'

source: -- issue all the requests at once and wait until they all return
zh_cn: -- 一次性发起所有请求，等待所有请求都返回

source: -- just throw away any remaining chunk data
zh_cn: -- 丢弃剩下的块数据

source: -- loop over the responses table
zh_cn: -- 对响应 table进行遍历

source: -- now abort all the "light threads" running in the current request handler
zh_cn: -- 现在中断当前请求处理器中运行的所有"轻量线程"

source: -- now res == 'a%2fb' </geshi>
zh_cn: -- 现在 res == 'a%2fb' </geshi>

source: -- output the results in the order that they
zh_cn: -- 结果按实际返回的次序输出

source: -- process the response table "resp"
zh_cn: -- 对响应table "resp"进行处理

source: -- push the data uri, args, and status to the remote
zh_cn: -- 使用ngx.socket.tcp 或 ngx.socket.udp将数据uri, 参数和状态推送给远程

source: -- query mysql, memcached, and a remote http service at the same time,
zh_cn: -- 同时请求mysql, memcached, 和一个远程http服务,

source: -- save I/O operations)
zh_cn: -- 减少I/O操作)

source: -- stop the "world", aborting other running threads
zh_cn: -- 停止所有，中断当前运行的线程

source: -- tests passed
zh_cn: -- 测试通过

source: -- to cause quit the whole request rather than the current phase handler
zh_cn: -- 导致退出整个请求而不是当前阶段处理器

source: -- to prevent use of casual module global variables
zh_cn: -- 防止随意使用模块全局变量

source: -- yields "Thu, 18 Nov 2010 11:27:35 GMT" </geshi>
zh_cn: -- 输出 "Thu, 18 Nov 2010 11:27:35 GMT" </geshi>

source: -- yields "Thu, 18-Nov-10 11:27:35 GMT" </geshi>
zh_cn: -- 输出 "Thu, 18-Nov-10 11:27:35 GMT" </geshi>

source: --- use the val repeatedly later </geshi>
zh_cn: --- 后续重复使用val </geshi>

source: -agentzh'</code> will be returned.
zh_cn: -agentzh'</code> .

# -agentzh --abcedhb blah blah'</code>, then the string <code>'hello, world!
source: -agentzh\r\n--abcedhb blah blah'</code>, then the string <code>'hello, world!
zh_cn: -agentzh\r\n--abcedhb blah blah'</code>, 则将返回 <code>'hello, world!

source: -agentzh\r\n--abcedhb blah blah'</code>, we shall get the following output from the sample code above:
zh_cn: -agentzh\r\n--abcedhb blah blah'</code>, 我们将得到这样的输出:

source: : instead of the old deprecated form:
zh_cn: : 而不是已经不推荐的形式:

source: <code>0</code> delay can also be specified, in which case the timer will immediately expire when the current handler yields execution.
zh_cn: 也可以指定<code>0</code>延迟，这样当前处理器挂起时定时器将立即过期.

source: <code>GET /test?=hello&=world</code> will yield an empty output for instance.
zh_cn: 例如，<code>GET /test?=hello&=world</code> 的结果为空.

source: <code>GET /test?foo&bar</code> will yield:
zh_cn: <code>GET /test?foo&bar</code> 的结果:

source: <code>POST /test</code> with body <code>=hello&=world</code> will yield empty outputs for instance.
zh_cn: 例如，以请求体<code>=hello&=world</code>发送<code>POST /test</code> 将获得空白输出.

source: <code>POST /test</code> with request body <code>foo=&bar=</code> will return something like
zh_cn: 以请求体<code>foo=&bar=</code>发送 <code>POST /test</code>请求将返回

source: <code>ngx.flush</code> accepts an optional boolean <code>wait</code> argument (Default: <code>false</code>) first introduced in the <code>v0.3.1rc34</code> release.
zh_cn: <code>ngx.flush</code> 接受可选的 boolean <code>wait</code> 参数(默认值: <code>false</code>)，从 <code>v0.3.1rc34</code> 版本开始引入。

source: <code>res.body</code> holds the subrequest's response body data, which might be truncated.
zh_cn: <code>res.body</code> 保存子请求响应体数据，有可能被截断。

source: <code>res.header</code> holds all the response headers of the subrequest and it is a normal Lua table.
zh_cn: <code>res.header</code> 的值是子请求的所有响应头，这是一个正常的Lua table.

source: <code>res.status</code> holds the response status code for the subrequest response.
zh_cn: <code>res.status</code> 的值是子请求响应的响应状态码。

source: = Bugs and Patches =
zh_cn: = Bug与补丁 =

source: = Changes =
zh_cn: = 变动 =

source: = Code Repository =
zh_cn: = 代码仓库 =

source: = Community =
zh_cn: = 社区 =

source: = Data Sharing within an Nginx Worker =
zh_cn: = 在一个Nginx Worker进程内部共享数据 =

source: = Description =
zh_cn: = 说明 =

source: = Directives =
zh_cn: = 命令 =

source: = HTTP 1.0 support =
zh_cn: = HTTP 1.0 支持 =

source: = Installation =
zh_cn: = 安装 =

source: = Known Issues =
zh_cn: = 已知问题 =

source: = Lua/LuaJIT bytecode support =
zh_cn: = Lua/LuaJIT 字节码支持 =

source: = Name =
zh_cn: = 名称 =

source: = Nginx API for Lua = == Introduction == The various <code>*_by_lua</code> and <code>*_by_lua_file</code> configuration directives serve as gateways to the Lua API within the <code>nginx.conf</code> file.
zh_cn: = 可供Lua调用的Nginx API = == 简介 == 各种 <code>*_by_lua</code> and <code>*_by_lua_file</code> 配置命令的作用是在<code>nginx.conf</code>文件内部提供访问Lua API的入口.

source: = Nginx Compatibility = The latest module is compatible with the following versions of Nginx:
zh_cn: = Nginx 兼容性 = 最新的模块版本兼容以下Nginx版本:

source: = See Also =
zh_cn: = 参阅 =

source: = Status =
zh_cn: = 状态 =

source: = Synopsis = <geshi lang="nginx">
zh_cn: = 示例 = <geshi lang="nginx">

source: = Test Suite =
zh_cn: = 测试包 =

source: = Typical Uses =
zh_cn: = 典型用法 =

source: = Version =
zh_cn: = 版本 =

source: == Chinese Mailing List ==
zh_cn: == 中文邮件列表 ==

source: == Core constants == '''context:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, *log_by_lua*, ngx.timer.*''
zh_cn: == 核心常量 == '''可包含于:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, *log_by_lua*, ngx.timer.*''

source: == English Mailing List ==
zh_cn: == 英文邮件列表 ==

source: == HTTP method constants == '''context:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''
zh_cn: == HTTP 请求方法常量 == '''可包含于:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''

source: == HTTP status constants == '''context:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''
zh_cn: == HTTP status constants == '''可包含于:''' ''init_by_lua*, set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''

source: == Installation on Ubuntu 11.10 ==
zh_cn: == 在 Ubuntu 11.10 上安装 ==

source: == Locations Configured by Subrequest Directives of Other Modules == The [[#ngx.location.capture|ngx.location.capture]] and [[#ngx.location.capture_multi|ngx.location.capture_multi]] directives cannot capture locations that include the [[HttpEchoModule#echo_location|echo_location]], [[HttpEchoModule#echo_location_async|echo_location_async]], [[HttpEchoModule#echo_subrequest|echo_subrequest]], or [[HttpEchoModule#echo_subrequest_async|echo_subrequest_async]] directives.
zh_cn: == 由子请求命令或其它模块配置的Location == [[#ngx.location.capture|ngx.location.capture]] 和 [[#ngx.location.capture_multi|ngx.location.capture_multi]] 命令不能获取包含 [[HttpEchoModule#echo_location|echo_location]], [[HttpEchoModule#echo_location_async|echo_location_async]], [[HttpEchoModule#echo_subrequest|echo_subrequest]], 或 [[HttpEchoModule#echo_subrequest_async|echo_subrequest_async]] 命令的location.

source: == Lua Coroutine Yielding/Resuming == * Lua's <code>dofile</code> builtin is implemented as a C function in both Lua 5.1 and LuaJIT 2.0 and when [[#ngx.location.capture|ngx.location.capture]] is called, [[#ngx.exec|ngx.exec]], [[#ngx.exit|ngx.exit]] or [[#ngx.req.read_body|ngx.req.read_body]] or similar in the file to be loaded by <code>dofile</code>, a coroutine yield across the C function boundary will be initiated.
zh_cn: == Lua Coroutine 的挂起/恢复 == * Lua内置的 <code>dofile</code> 在Lua 5.1和LuaJIT2.0中都是用 C 函数实现的， 如果在将被<code>dofile</code>加载的文件中调用了[[#ngx.location.capture|ngx.location.capture]], [[#ngx.exec|ngx.exec]], [[#ngx.exit|ngx.exit]] or [[#ngx.req.read_body|ngx.req.read_body]] , 将导致跨越C函数边界的coroutine挂起.

source: == Lua Variable Scope == Care must be taken when importing modules and this form should be used:
zh_cn: == Lua 变量作用域 == 在导入模块时需要小心，应该使用这种形式:

source: == Nginx log level constants == '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''
zh_cn: == Nginx 日志级别常量 == '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''

source: == Special PCRE Sequences == PCRE sequences such as <code>\d</code>, <code>\s</code>, or <code>\w</code>, require special attention because in string literals, the backslash character, <code>\</code>, is stripped out by both the Lua language parser and by the Nginx config file parser before processing.
zh_cn: == 特殊PCRE序列 == PCRE sequences such as <code>\d</code>, <code>\s</code>, or <code>\w</code>这样的PCRE序列需要引起特别的重视，因为在字符串写法里， <code>\</code>会被Lua语言解析器和Nginx配置文件解析器在开始处理前删掉.

source: == TCP socket connect operation issues == The [[#tcpsock:connect|tcpsock:connect]] method may indicate <code>success</code> despite connection failures such as with <code>Connection Refused</code> errors.
zh_cn: == TCP socket 连接操作问题 == [[#tcpsock:connect|tcpsock:connect]] 方法可能在连接失败如<code>Connection Refused</code>时返回 <code>success</code> .

source: == coroutine.create == '''syntax:''' ''co = coroutine.create(f)''
zh_cn: == coroutine.create == '''语法:''' ''co = coroutine.create(f)''

source: == coroutine.resume == '''syntax:''' ''ok, ... = coroutine.resume(co, ...)''
zh_cn: == coroutine.resume == '''语法:''' ''ok, ... = coroutine.resume(co, ...)''

source: == coroutine.running == '''syntax:''' ''co = coroutine.running()''
zh_cn: == coroutine.running == '''语法:''' ''co = coroutine.running()''

source: == coroutine.status == '''syntax:''' ''status = coroutine.status(co)''
zh_cn: == coroutine.status == '''语法:''' ''status = coroutine.status(co)''

source: == coroutine.wrap == '''syntax:''' ''co = coroutine.wrap(f)''
zh_cn: == coroutine.wrap == '''语法:''' ''co = coroutine.wrap(f)''

source: == coroutine.yield == '''syntax:''' ''... = coroutine.yield(co, ...)''
zh_cn: == coroutine.yield == '''语法:''' ''... = coroutine.yield(co, ...)''

source: == lua_code_cache == '''syntax:''' ''lua_code_cache on | off''
zh_cn: == lua_code_cache == '''语法:''' ''lua_code_cache on | off''

source: == lua_regex_cache_max_entries == '''syntax:''' ''lua_regex_cache_max_entries <num>''
zh_cn: == lua_regex_cache_max_entries == '''语法:''' ''lua_regex_cache_max_entries <num>''

source: == lua_regex_match_limit == '''syntax:''' ''lua_regex_match_limit <num>''
zh_cn: == lua_regex_match_limit == '''语法:''' ''lua_regex_match_limit <num>''

source: == ndk.set_var.DIRECTIVE == '''syntax:''' ''res = ndk.set_var.DIRECTIVE_NAME''
zh_cn: == ndk.set_var.DIRECTIVE == '''语法:''' ''res = ndk.set_var.DIRECTIVE_NAME''

source: == ngx.arg == '''syntax:''' ''val = ngx.arg[index]''
zh_cn: == ngx.arg == '''语法:''' ''val = ngx.arg[index]''

source: == ngx.cookie_time == '''syntax:''' ''str = ngx.cookie_time(sec)''
zh_cn: == ngx.cookie_time == '''语法:''' ''str = ngx.cookie_time(sec)''

source: == ngx.crc32_long == '''syntax:''' ''intval = ngx.crc32_long(str)''
zh_cn: == ngx.crc32_long == '''语法:''' ''intval = ngx.crc32_long(str)''

source: == ngx.crc32_short == '''syntax:''' ''intval = ngx.crc32_short(str)''
zh_cn: == ngx.crc32_short == '''语法:''' ''intval = ngx.crc32_short(str)''

source: == ngx.ctx == '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''
zh_cn: == ngx.ctx == '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*, ngx.timer.*''

source: == ngx.decode_args == '''syntax:''' ''table = ngx.decode_args(str, max_args?)''
zh_cn: == ngx.decode_args == '''语法:''' ''table = ngx.decode_args(str, max_args?)''

source: == ngx.decode_base64 == '''syntax:''' ''newstr = ngx.decode_base64(str)''
zh_cn: == ngx.decode_base64 == '''语法:''' ''newstr = ngx.decode_base64(str)''

source: == ngx.encode_args == '''syntax:''' ''str = ngx.encode_args(table)''
zh_cn: == ngx.encode_args == '''语法:''' ''str = ngx.encode_args(table)''

source: == ngx.encode_base64 == '''syntax:''' ''newstr = ngx.encode_base64(str)''
zh_cn: == ngx.encode_base64 == '''语法:''' ''newstr = ngx.encode_base64(str)''

source: == ngx.eof == '''syntax:''' ''ok, err = ngx.eof()''
zh_cn: == ngx.eof == '''语法:''' ''ok, err = ngx.eof()''

source: == ngx.escape_uri == '''syntax:''' ''newstr = ngx.escape_uri(str)''
zh_cn: == ngx.escape_uri == '''语法:''' ''newstr = ngx.escape_uri(str)''

source: == ngx.exec == '''syntax:''' ''ngx.exec(uri, args?)''
zh_cn: == ngx.exec == '''语法:''' ''ngx.exec(uri, args?)''

source: == ngx.exit == '''syntax:''' ''ngx.exit(status)''
zh_cn: == ngx.exit == '''语法:''' ''ngx.exit(status)''

source: == ngx.flush == '''syntax:''' ''ok, err = ngx.flush(wait?)''
zh_cn: == ngx.flush == '''语法:''' ''ok, err = ngx.flush(wait?)''

source: == ngx.get_phase == '''syntax:''' ''str = ngx.get_phase()''
zh_cn: == ngx.get_phase == '''语法:''' ''str = ngx.get_phase()''

source: == ngx.header.HEADER == '''syntax:''' ''ngx.header.HEADER = VALUE''
zh_cn: == ngx.header.HEADER == '''语法:''' ''ngx.header.HEADER = VALUE''

source: == ngx.headers_sent == '''syntax:''' ''value = ngx.headers_sent''
zh_cn: == ngx.headers_sent == '''语法:''' ''value = ngx.headers_sent''

source: == ngx.hmac_sha1 == '''syntax:''' ''digest = ngx.hmac_sha1(secret_key, str)''
zh_cn: == ngx.hmac_sha1 == '''语法:''' ''digest = ngx.hmac_sha1(secret_key, str)''

source: == ngx.http_time == '''syntax:''' ''str = ngx.http_time(sec)''
zh_cn: == ngx.http_time == '''语法:''' ''str = ngx.http_time(sec)''

source: == ngx.is_subrequest == '''syntax:''' ''value = ngx.is_subrequest''
zh_cn: == ngx.is_subrequest == '''语法:''' ''value = ngx.is_subrequest''

source: == ngx.localtime == '''syntax:''' ''str = ngx.localtime()''
zh_cn: == ngx.localtime == '''语法:''' ''str = ngx.localtime()''

source: == ngx.location.capture == '''syntax:''' ''res = ngx.location.capture(uri, options?)''
zh_cn: == ngx.location.capture == '''语法:''' ''res = ngx.location.capture(uri, options?)''

source: == ngx.location.capture_multi == '''syntax:''' ''res1, res2, ... = ngx.location.capture_multi({ {uri, options?}, {uri, options?}, ... })''
zh_cn: == ngx.location.capture_multi == '''语法:''' ''res1, res2, ... = ngx.location.capture_multi({ {uri, options?}, {uri, options?}, ... })''

source: == ngx.log == '''syntax:''' ''ngx.log(log_level, ...)''
zh_cn: == ngx.log == '''语法:''' ''ngx.log(log_level, ...)''

source: == ngx.md5 == '''syntax:''' ''digest = ngx.md5(str)''
zh_cn: == ngx.md5 == '''语法:''' ''digest = ngx.md5(str)''

source: == ngx.md5_bin == '''syntax:''' ''digest = ngx.md5_bin(str)''
zh_cn: == ngx.md5_bin == '''语法:''' ''digest = ngx.md5_bin(str)''

source: == ngx.now == '''syntax:''' ''secs = ngx.now()''
zh_cn: == ngx.now == '''语法:''' ''secs = ngx.now()''

source: == ngx.on_abort == '''syntax:''' ''ok, err = ngx.on_abort(callback)''
zh_cn: == ngx.on_abort == '''语法:''' ''ok, err = ngx.on_abort(callback)''

source: == ngx.parse_http_time == '''syntax:''' ''sec = ngx.parse_http_time(str)''
zh_cn: == ngx.parse_http_time == '''语法:''' ''sec = ngx.parse_http_time(str)''

source: == ngx.print == '''syntax:''' ''ok, err = ngx.print(...)''
zh_cn: == ngx.print == '''语法:''' ''ok, err = ngx.print(...)''

source: == ngx.quote_sql_str == '''syntax:''' ''quoted_value = ngx.quote_sql_str(raw_value)''
zh_cn: == ngx.quote_sql_str == '''语法:''' ''quoted_value = ngx.quote_sql_str(raw_value)''

source: == ngx.re.gmatch == '''syntax:''' ''iterator, err = ngx.re.gmatch(subject, regex, options?)''
zh_cn: == ngx.re.gmatch == '''语法:''' ''iterator, err = ngx.re.gmatch(subject, regex, options?)''

source: == ngx.re.gsub == '''syntax:''' ''newstr, n, err = ngx.re.gsub(subject, regex, replace, options?)''
zh_cn: == ngx.re.gsub == '''语法:''' ''newstr, n, err = ngx.re.gsub(subject, regex, replace, options?)''

source: == ngx.re.match == '''syntax:''' ''captures, err = ngx.re.match(subject, regex, options?, ctx?)''
zh_cn: == ngx.re.match == '''语法:''' ''captures, err = ngx.re.match(subject, regex, options?, ctx?)''

source: == ngx.re.sub == '''syntax:''' ''newstr, n, err = ngx.re.sub(subject, regex, replace, options?)''
zh_cn: == ngx.re.sub == '''语法:''' ''newstr, n, err = ngx.re.sub(subject, regex, replace, options?)''

source: == ngx.redirect == '''syntax:''' ''ngx.redirect(uri, status?)''
zh_cn: == ngx.redirect == '''语法:''' ''ngx.redirect(uri, status?)''

source: == ngx.req.append_body == '''syntax:''' ''ngx.req.append_body(data_chunk)''
zh_cn: == ngx.req.append_body == '''语法:''' ''ngx.req.append_body(data_chunk)''

source: == ngx.req.clear_header == '''syntax:''' ''ngx.req.clear_header(header_name)''
zh_cn: == ngx.req.clear_header == '''语法:''' ''ngx.req.clear_header(header_name)''

source: == ngx.req.discard_body == '''syntax:''' ''ngx.req.discard_body()''
zh_cn: == ngx.req.discard_body == '''语法:''' ''ngx.req.discard_body()''

source: == ngx.req.finish_body == '''syntax:''' ''ngx.req.finish_body()''
zh_cn: == ngx.req.finish_body == '''语法:''' ''ngx.req.finish_body()''

source: == ngx.req.get_body_data == '''syntax:''' ''data = ngx.req.get_body_data()''
zh_cn: == ngx.req.get_body_data == '''语法:''' ''data = ngx.req.get_body_data()''

source: == ngx.req.get_body_file == '''syntax:''' ''file_name = ngx.req.get_body_file()''
zh_cn: == ngx.req.get_body_file == '''语法:''' ''file_name = ngx.req.get_body_file()''

source: == ngx.req.get_method == '''syntax:''' ''method_name = ngx.req.get_method()''
zh_cn: == ngx.req.get_method == '''语法:''' ''method_name = ngx.req.get_method()''

source: == ngx.req.get_post_args == '''syntax:''' ''args, err = ngx.req.get_post_args(max_args?)''
zh_cn: == ngx.req.get_post_args == '''语法:''' ''args, err = ngx.req.get_post_args(max_args?)''

source: == ngx.req.get_uri_args == '''syntax:''' ''args = ngx.req.get_uri_args(max_args?)''
zh_cn: == ngx.req.get_uri_args == '''语法:''' ''args = ngx.req.get_uri_args(max_args?)''

source: == ngx.req.http_version == '''syntax:''' ''num = ngx.req.http_version()''
zh_cn: == ngx.req.http_version == '''语法:''' ''num = ngx.req.http_version()''

source: == ngx.req.init_body == '''syntax:''' ''ngx.req.init_body(buffer_size?)''
zh_cn: == ngx.req.init_body == '''语法:''' ''ngx.req.init_body(buffer_size?)''

source: == ngx.req.raw_header == '''syntax:''' ''str = ngx.req.raw_header(no_request_line?)''
zh_cn: == ngx.req.raw_header == '''语法:''' ''str = ngx.req.raw_header(no_request_line?)''
